Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
  /*Configure GPIO pins : PE0 PE1 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/**
  * @brief  This function sends a string to UART1 to be received in a terminal
	* @param  *Array is a pointer to the string
						count is an int equal to the number of characters in the string
  * @retval None
  */
void Debug(char *Array, int count)
{
	uint8_t TXBuffer[count+1];
	for(int i = 0; i!=count;i++)
	{
		TXBuffer[i] = Array[i];
	}		
	
	TXBuffer[count] ='\r';
	TXBuffer[count+1] ='\n';
	HAL_UART_Transmit(&huart1,TXBuffer,count+2,10);
}

/**
  * @brief  This function is executed in the case of an error with the UART modules
	* @param  *huart is a handle of the UART module in question
  * @retval None
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	Debug("Bluetooth Error",15);
}

/**
  * @brief  This function configures the timers used in generating the servo signals
	* @param  None
  * @retval None
  */
void SetupTimers(void)
{
	//Timer 6
	//50Hz Interrupt
	ServoTimer.Instance =TIM6;
	ServoTimer.Init.Prescaler =40000;
	ServoTimer.Init.CounterMode = TIM_COUNTERMODE_UP;
	ServoTimer.Init.Period =54;
	ServoTimer.Init.RepetitionCounter = 0;
	HAL_TIM_Base_Init(&ServoTimer);
	HAL_TIM_Base_Start_IT(&ServoTimer);
	
	//Timer 7
	//Variable frequency interrupt
	htim7.Instance =TIM7;
	htim7.Init.Prescaler =1000;
	htim7.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim7.Init.Period =160;
	htim7.Init.RepetitionCounter = 0;
	HAL_TIM_Base_Init(&htim7);
	HAL_TIM_Base_Start_IT(&htim7);
}
	

/** @brief Function for sorting the desired leg angles into ascending order 
						to make timer functions simpler
  * @param None
  * @retval None */
void Sort(void)
{
	for(int i = 0;i<15;i++)
	{
		for(int j = i+1;j<15;j++)
		{
			if(legAngles[0][i] > legAngles[0][j])
			{
				//swop the angles
				int a = legAngles[0][i];
				legAngles[0][i] = legAngles[0][j];
				legAngles[0][j] = a;
				//now swop the index
				a = legAngles_id[0][i];
				legAngles_id[0][i] = legAngles_id[0][j];
				legAngles_id[0][j] = a;
			}
		}
	}
}

/**
  * @brief  This function executes when a timer interrupts. It is used to generate servo signals
	* @param  *htim is a handle of the timer module that triggered the interrupt
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
	{
		
		if(htim == &htim7){
			if(legAngleFlag == true)
			{
				bufferLevel = 2;
			}else{
				bufferLevel = 1;
			}
			HAL_GPIO_TogglePin(greenLEDPort,greenLEDPin);
			//Turn off
			++servoCount;			
			if (servoCount < 15)
			{
				newPeriod = (legAngles[bufferLevel][servoCount]- legAngles[bufferLevel][servoCount-1]);
				
				while (newPeriod == 0)
				{
					HAL_GPIO_WritePin(servoPortArray[legAngles_id[bufferLevel][servoCount-1]-1] ,servoPinArray[legAngles_id[bufferLevel][servoCount-1]-1],GPIO_PIN_RESET);
					++servoCount;
					newPeriod = (legAngles[bufferLevel][servoCount]- legAngles[bufferLevel][servoCount-1]);
				}
//				TIM7->CNT = 0;
				
				//Adjust for time lost in this subroutine
				if (newPeriod>1)
				{
					--newPeriod;
				}
				if (newPeriod < 0)
				{
					newPeriod = 0;
				}
				TIM7->ARR = (newPeriod);
				HAL_GPIO_WritePin(servoPortArray[legAngles_id[bufferLevel][servoCount-1]-1] ,servoPinArray[legAngles_id[bufferLevel][servoCount-1]-1],GPIO_PIN_RESET);
			}else{
				//Turn off servo 15
				HAL_GPIO_WritePin(servoPortArray[legAngles_id[bufferLevel][14]-1] ,servoPinArray[legAngles_id[bufferLevel][14]-1],GPIO_PIN_RESET);
				//Stop the timer for the rest of the cycle
				HAL_TIM_Base_Stop(&htim7);
				if (servoCount != 0xF)
				{
					Debug("servoCount Error",16);
				}
				servoCount = 0;
			}
		}else if (htim == &htim6)
		{
			servoCount = 0;
			//50Hz Interrupt
			HAL_GPIO_TogglePin(redLEDPort,redLEDPin);
			//Turn all on
			HAL_GPIO_WritePin(servo1Port,servo1Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo2Port,servo2Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo3Port,servo3Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo4Port,servo4Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo5Port,servo5Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo6Port,servo6Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo7Port,servo7Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo8Port,servo8Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo9Port,servo9Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo10Port,servo10Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo11Port,servo11Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo12Port,servo12Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo13Port,servo13Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo14Port,servo14Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo15Port,servo15Pin,GPIO_PIN_SET);
			

			if(legAngleFlag == true)
			{
				bufferLevel = 2;
			}else{
				bufferLevel = 1;
			}
			//Set period for 1st servo
			newPeriod = legAngles[bufferLevel][servoCount];
			while (newPeriod == 0 && servoCount < 16)
			{
				++servoCount;
				newPeriod = legAngles[bufferLevel][servoCount];
			}
				
			TIM7->ARR = newPeriod;
			//Start the timer
			HAL_TIM_Base_Start(&htim7);
			
			//BT LED
			++BTCount;
			if (BTCount > 120) //20ms * 120 = 2.4s
			{
				//Turn LED off
				HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(servoPowerPort,servoPowerPin,GPIO_PIN_RESET);
				BTCount = 0;
//				HAL_GPIO_TogglePin(greenLEDPort,greenLEDPin);
//				HAL_GPIO_TogglePin(redLEDPort,redLEDPin);
			}
		}else{
			Debug("Timer Interrupt Error",21);
		}
	}


/**
  * @brief  This function calculates the required timer values for each of the servos
	* @param  servo is an int in the range 1:15 corresponding to a specific joint
						degrees is an int in the range 0:180 for the required position of the specific servo
  * @retval None
  */	
void SetServo(int servo, int degrees)
{
	//Set the servo with the correct index in the array 
	for (int i = 0; i<15; i++)
	{
		if (servo == legAngles_id[0][i])
		{
			legAngles[0][i] =servoOffset[servo-1] + (degrees*(servoMultiplier[servo-1])/180);
			return;
		}
	}
}

/**
  * @brief  This function does the inverse kinematic calculations for a specific leg
	* @param  input is a struct of type coordinates with members x, y and z
							corresponding to the required position of the foot relative to the hip.
  * @retval servos is a struct with members theta, phi and alpha corresponding with the 
							resulting angles required.
  */
struct servos IK( struct coordinates input)
{
	//make the return struct
	struct servos result;
	//Calculate theta
	double theta = atan2(input.x,input.y);
	//Calculate coordinates of joint 2
	double x = A_length * sin(theta);
	double y = A_length * cos(theta);
	//horizontal distance from joint 1 to foot
	double reach = sqrt(pow(input.x-x,2)+pow(input.y-y,2));
	//Absolute distance between joint 2 and foot
	double twoToFoot = sqrt(pow(input.x-x,2)+pow(input.y-y,2) +pow(input.z-z_body,2));
	//perform Cosine rule to get alpha
	double f =((pow(B_length ,2) + pow(C_length,2) - pow(twoToFoot ,2))/(2*B_length*C_length));
	double d = acos(f);
	double alpha =(rad2deg * d) + 0.5;		//+0.5 for rounding
	result.alpha = (int)alpha;
	//use sine rule to get phi
	double c = asin(C_length * sin(d) / twoToFoot);
	double e = atan2(reach ,z_body-input.z);
	double phi = 270 - c*rad2deg - e*rad2deg + 0.5; // +0.5 for rounding
	result.phi = (int)phi;
	//convert theta to degrees. Add 0.5 for rounding
	theta = (theta * rad2deg) + 0.5;
	result.theta = 180-(int)theta;
	
	return result;
}

/**
  * @brief  This function checks that all legs are within the boundaries specified and
							writes the results in a global array
	* @param  None
  * @retval None
  */
void CheckBounds(void)
{
	for(int i = 0 ; i<5 ; i++)
	{
		//
		if ( legAngles[0][i+1] < 50 || legAngles[0][i+1] > 120		// 50 < theta < 120
			|| legAngles[0][i+6] < 90 || legAngles[0][i+6] > 170		// 90 < phi   < 170
			|| legAngles[0][i+11]< 70 || legAngles[0][i+11]> 130)		// 70 < alpha < 130
		{
			resetStatus[i] = true;				
		}else{
			resetStatus[i] = false;
		}
	}			
}

/**
  * @brief  This function rotates the given coordinates about the origin through a given angle 
	* @param  x,y are doubles corresponding to the coordinates
						angle is a double in degrees
  * @retval a coordinates struct with members x, y and z. z is not used in this case.
  */
struct coordinates Rotate(double x, double y, double angle)
{
	//Create output struct
	struct coordinates result;
	//convert angle to radians
	angle = angle/rad2deg;
	//calculate return values
	result.x = x * cos(angle) - y * sin(angle);
	result.y = x * sin(angle) + y * cos(angle);
	
	return result;
}

/**
  * @brief  This function calculates the normalized position of a leg from the 
							given movement vectors
	* @param	x is a double with the X vector
						y iss a double with the Y vector
						leg is an int in the range 1:5
						offset is a bool indicating whether the coordinates should be
							denormalized
  * @retval a struct of type coordinates. The z member is unused
  */
struct coordinates Vector(double x, double y, int leg, bool offset)
{
	//Create return struct
	struct coordinates result;
	//Make the trajectory polar with a magnitude and angle
	double trajectory = atan2(y,x);
	double magnitude = sqrt(pow(x,2)+pow(y,2));
	//Match the trajectory to the leg
	struct coordinates neutral;
	//Translation components
	if (offset)
	{
		neutral = Rotate(270,0,(leg-1)*72);
		struct coordinates offset= Rotate(robotRadius,0,(leg-1)*72);
		neutral.x = neutral.x - offset.x;
		neutral.y = neutral.y - offset.y;
	}else{
		neutral.x = 0;
		neutral.y = 0;
	}
	result.x = neutral.x + magnitude*cos(trajectory) + translateLeg[0][leg-1];
	result.y = neutral.y + magnitude*sin(trajectory) + translateLeg[1][leg-1];
	//+ Rotation
	struct coordinates temp = Rotate(result.x,result.y,-(leg-1)*72);
	result.x = temp.x - translateLeg[0][0];
	result.y = temp.y - translateLeg[1][0];
	if (offset)
	{
		destination[0][leg-1] = result.x;
		destination[1][leg-1] = result.y;
	}
	return result;
}

/**
  * @brief  This function 
	* @param  None
  * @retval None
  */	
void TranslateLeg(void)
{
	for(int leg = 0; leg < 5; leg++)
	{
		translateLeg[0][leg] = robotRadius * cos(leg*72/rad2deg);
		translateLeg[1][leg] = robotRadius * sin(leg*72/rad2deg);
	}
}

/**
  * @brief  This function resets a leg if it is out of bounds
	* @param  leg is an int in the range 1:5
  * @retval None
  */
void ResetLeg(int leg)
{
	//Lift up the leg where it is currently
	struct coordinates lift;
	lift.x = destination[0][leg-1];
	lift.y = destination[1][leg-1];
	lift.z = 30;
	struct servos leg_up = IK(lift);
	//Send this to servos and wait
	//Now move the leg over to the new position
	struct coordinates reset = Vector(X_Vector,Y_Vector,leg,true);
	reset.z = 30;
	struct servos leg_reset = IK(reset);
	//Send this to servos and wait
	//Now put down the leg where it is
	reset.z = 0;
	leg_reset = IK(reset);
	//Send this to the servos and wait
}

void StartPosition(void)
{
	//Set servo begin positions
	SetServo(1,90);
	SetServo(2,90);
	SetServo(3,90);
	SetServo(4,90);
	SetServo(5,90);
	SetServo(6,100);
	SetServo(7,100);
	SetServo(8,100);
	SetServo(9,100);
	SetServo(10,100);
	SetServo(11,90);
	SetServo(12,90);
	SetServo(13,90);
	SetServo(14,90);
	SetServo(15,90);
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }

	
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
